solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWAR_cm33_core0
**                          MIMXRT735SGAWAR_cm33_core1
**                          MIMXRT735SGAWAR_ezhv
**                          MIMXRT735SGAWAR_hifi1
**                          MIMXRT735SGFOA_cm33_core0
**                          MIMXRT735SGFOA_cm33_core1
**                          MIMXRT735SGFOA_ezhv
**                          MIMXRT735SGFOA_hifi1
**                          MIMXRT758SGAWAR_cm33_core0
**                          MIMXRT758SGAWAR_cm33_core1
**                          MIMXRT758SGAWAR_ezhv
**                          MIMXRT758SGAWAR_hifi1
**                          MIMXRT758SGFOA_cm33_core0
**                          MIMXRT758SGFOA_cm33_core1
**                          MIMXRT758SGFOA_ezhv
**                          MIMXRT758SGFOA_hifi1
**                          MIMXRT798SGAWAR_cm33_core0
**                          MIMXRT798SGAWAR_cm33_core1
**                          MIMXRT798SGAWAR_ezhv
**                          MIMXRT798SGAWAR_hifi1
**                          MIMXRT798SGAWAR_hifi4
**                          MIMXRT798SGFOA_cm33_core0
**                          MIMXRT798SGFOA_cm33_core1
**                          MIMXRT798SGFOA_ezhv
**                          MIMXRT798SGFOA_hifi1
**                          MIMXRT798SGFOA_hifi4
**
**     Version:             rev. 2.0, 2024-05-28
**     Build:               b241121
**
**     Abstract:
**         CMSIS Peripheral Access Layer for CLKCTL0
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**
** ###################################################################
*/

/*!
 * @file CLKCTL0.h
 * @version 2.0
 * @date 2024-05-28
 * @brief CMSIS Peripheral Access Layer for CLKCTL0
 *
 * CMSIS Peripheral Access Layer for CLKCTL0
 */

#if !defined(CLKCTL0_H_)
#define CLKCTL0_H_                               /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT735SGAWAR_cm33_core0) || defined(CPU_MIMXRT735SGFOA_cm33_core0))
#include "MIMXRT735S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_cm33_core1) || defined(CPU_MIMXRT735SGFOA_cm33_core1))
#include "MIMXRT735S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_ezhv) || defined(CPU_MIMXRT735SGFOA_ezhv))
#include "MIMXRT735S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_hifi1) || defined(CPU_MIMXRT735SGFOA_hifi1))
#include "MIMXRT735S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_cm33_core0) || defined(CPU_MIMXRT758SGFOA_cm33_core0))
#include "MIMXRT758S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_cm33_core1) || defined(CPU_MIMXRT758SGFOA_cm33_core1))
#include "MIMXRT758S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_ezhv) || defined(CPU_MIMXRT758SGFOA_ezhv))
#include "MIMXRT758S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_hifi1) || defined(CPU_MIMXRT758SGFOA_hifi1))
#include "MIMXRT758S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_cm33_core0) || defined(CPU_MIMXRT798SGFOA_cm33_core0))
#include "MIMXRT798S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_cm33_core1) || defined(CPU_MIMXRT798SGFOA_cm33_core1))
#include "MIMXRT798S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_ezhv) || defined(CPU_MIMXRT798SGFOA_ezhv))
#include "MIMXRT798S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_hifi1) || defined(CPU_MIMXRT798SGFOA_hifi1))
#include "MIMXRT798S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_hifi4) || defined(CPU_MIMXRT798SGFOA_hifi4))
#include "MIMXRT798S_hifi4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- CLKCTL0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL0_Peripheral_Access_Layer CLKCTL0 Peripheral Access Layer
 * @{
 */

/** CLKCTL0 - Size of Registers Arrays */
#define CLKCTL0_FLEXCOMM_COUNT                    14u
#define CLKCTL0_CTIMER_COUNT                      5u
#define CLKCTL0_CTIMERNFCLKSEL_COUNT              5u

/** CLKCTL0 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PSCCTL0;                           /**< VDD2_COMP Peripheral Clock Control 0, offset: 0x10 */
  __IO uint32_t PSCCTL1;                           /**< VDD2_COMP Peripheral Clock Control 1, offset: 0x14 */
  __IO uint32_t PSCCTL2;                           /**< VDD2_COMP Peripheral Clock Control 2, offset: 0x18 */
  __IO uint32_t PSCCTL3;                           /**< VDD2_COMP Peripheral Clock Control 3, offset: 0x1C */
  __IO uint32_t PSCCTL4;                           /**< VDD2_COMP Peripheral Clock Control 4, offset: 0x20 */
  __IO uint32_t PSCCTL5;                           /**< VDD2_COMP Peripheral Clock Control 5, offset: 0x24 */
       uint8_t RESERVED_1[24];
  __IO uint32_t PSCCTL0_SET;                       /**< VDD2_COMP Peripheral Clock Control 0 Set, offset: 0x40 */
  __IO uint32_t PSCCTL1_SET;                       /**< VDD2_COMP Peripheral Clock Control 1 Set, offset: 0x44 */
  __IO uint32_t PSCCTL2_SET;                       /**< VDD2_COMP Peripheral Clock Control 2 Set, offset: 0x48 */
  __IO uint32_t PSCCTL3_SET;                       /**< VDD2_COMP Peripheral Clock Control 3 Set, offset: 0x4C */
  __IO uint32_t PSCCTL4_SET;                       /**< VDD2_COMP Peripheral Clock Control 4 Set, offset: 0x50 */
  __IO uint32_t PSCCTL5_SET;                       /**< VDD2_COMP Peripheral Clock Control 5 Set, offset: 0x54 */
       uint8_t RESERVED_2[24];
  __IO uint32_t PSCCTL0_CLR;                       /**< VDD2_COMP Peripheral Clock Control 0 Clear, offset: 0x70 */
  __IO uint32_t PSCCTL1_CLR;                       /**< VDD2_COMP Peripheral Clock Control 1 Clear, offset: 0x74 */
  __IO uint32_t PSCCTL2_CLR;                       /**< VDD2_COMP Peripheral Clock Control 2 Clear, offset: 0x78 */
  __IO uint32_t PSCCTL3_CLR;                       /**< VDD2_COMP Peripheral Clock Control 3 Clear, offset: 0x7C */
  __IO uint32_t PSCCTL4_CLR;                       /**< VDD2_COMP Peripheral Clock Control 4 Clear, offset: 0x80 */
  __IO uint32_t PSCCTL5_CLR;                       /**< VDD2_COMP Peripheral Clock Control 5 Clear, offset: 0x84 */
       uint8_t RESERVED_3[8];
  __IO uint32_t ONE_SRC_CLKSLICE_ENABLE;           /**< One Source Clock Slice Enable, offset: 0x90 */
       uint8_t RESERVED_4[132];
  __I  uint32_t FRO01CLKSTATUS;                    /**< FRO_TUNER0 and FRO_TUNER1 Clock Status, offset: 0x118 */
       uint8_t RESERVED_5[12];
  __IO uint32_t FRO0MAXDOMAINEN;                   /**< FRO0MAX Clock Domain Enable, offset: 0x128 */
       uint8_t RESERVED_6[724];
  __IO uint32_t MAINCLKDIV;                        /**< VDD2_COMP Main Clock Divider, offset: 0x400 */
       uint8_t RESERVED_7[28];
  __IO uint32_t CMPTBASECLKSEL;                    /**< VDD2_COMP Base Clock Select Source, offset: 0x420 */
  __IO uint32_t DSPBASECLKSEL;                     /**< VDD2_DSP Base Clock Select Source, offset: 0x424 */
  __IO uint32_t VDD2COMBASECLKSEL;                 /**< VDD2_COM Base Clock Select Source, offset: 0x428 */
       uint8_t RESERVED_8[8];
  __IO uint32_t MAINCLKSEL;                        /**< VDD2_COMP Main Clock Source Select, offset: 0x434 */
       uint8_t RESERVED_9[8];
  __IO uint32_t DSPCPUCLKDIV;                      /**< VDD2_DSP Clock Divider, offset: 0x440 */
  __IO uint32_t DSPCPUCLKSEL;                      /**< VDD2_DSP Clock Select Source, offset: 0x444 */
       uint8_t RESERVED_10[8];
  __IO uint32_t RAMCLKSEL;                         /**< RAM Clock Select Source, offset: 0x450 */
       uint8_t RESERVED_11[8];
  __IO uint32_t RAMCLKDIV;                         /**< RAM Clock Divider, offset: 0x45C */
       uint8_t RESERVED_12[256];
  __IO uint32_t TPIUFCLKSEL;                       /**< TPIU (TRACE_RT700) Functional Clock Select Source, offset: 0x560 */
  __IO uint32_t TPIUCLKDIV;                        /**< TPIU (TRACE_RT700) Functional Clock Divider, offset: 0x564 */
       uint8_t RESERVED_13[152];
  __IO uint32_t XSPI0FCLKSEL;                      /**< XSPI0 Functional Clock Source Select, offset: 0x600 */
  __IO uint32_t XSPI0FCLKDIV;                      /**< XSPI0 Functional Clock Divider, offset: 0x604 */
       uint8_t RESERVED_14[24];
  __IO uint32_t XSPI1FCLKSEL;                      /**< XSPI1 Functional Clock Select Source, offset: 0x620 */
  __IO uint32_t XSPI1FCLKDIV;                      /**< XSPI1 Functional Clock Divider, offset: 0x624 */
       uint8_t RESERVED_15[24];
  __IO uint32_t SCTFCLKSEL;                        /**< SCT Functional Clock Source Select, offset: 0x640 */
  __IO uint32_t SCTFCLKDIV;                        /**< SCT Functional Clock Divider, offset: 0x644 */
       uint8_t RESERVED_16[184];
  __IO uint32_t UTICK0FCLKSEL;                     /**< UTICK0 Functional Clock Select Source, offset: 0x700 */
  __IO uint32_t UTICK0FCLKDIV;                     /**< UTICK0 Functional Clock Divider, offset: 0x704 */
       uint8_t RESERVED_17[24];
  __IO uint32_t WWDT0FCLKSEL;                      /**< WWDT0 Functional Clock Source Select, offset: 0x720 */
       uint8_t RESERVED_18[28];
  __IO uint32_t WWDT1FCLKSEL;                      /**< WWDT1 Functional Clock Source Select, offset: 0x740 */
       uint8_t RESERVED_19[28];
  __IO uint32_t SYSTICKFCLKSEL;                    /**< SYSTICK Functional Clock Source Select, offset: 0x760 */
  __IO uint32_t SYSTICKFCLKDIV;                    /**< SYSTICK Functional Clock Divider, offset: 0x764 */
       uint8_t RESERVED_20[152];
  struct {                                         /* offset: 0x800, array step: 0x20 */
    __IO uint32_t FCCLKSEL;                          /**< LP_FLEXCOMM 0 to 13 Clock Source 0 Select..LP_FLEXCOMM 0 to 13 Clock Source 3 Select, array offset: 0x800, array step: 0x20, valid indices: [0-3] */
    __IO uint32_t FCCLKDIV;                          /**< LP_FLEXCOMM 0 to 13 Clock Source 0 Divider..LP_FLEXCOMM 0 to 13 Clock Source 3 Divider, array offset: 0x804, array step: 0x20, valid indices: [0-3] */
    __IO uint32_t FCFCLKSEL;                         /**< LP_FLEXCOMM0 Clock Source Select..LP_FLEXCOMM13 Clock Source Select, array offset: 0x808, array step: 0x20 */
         uint8_t RESERVED_0[20];
  } FLEXCOMM[CLKCTL0_FLEXCOMM_COUNT];
       uint8_t RESERVED_21[8];
  __IO uint32_t SAI012FCLKSEL;                     /**< SAI0, SAI1 and SAI2 Clock Source Select, offset: 0x9C8 */
  __IO uint32_t SAI012CLKDIV;                      /**< SAI0, SAI1 and SAI2 Functional Clock Divider, offset: 0x9CC */
       uint8_t RESERVED_22[48];
  __IO uint32_t CTIMERCLKDIV[CLKCTL0_CTIMER_COUNT]; /**< CTIMER0 Functional Clock Divider..CTIMER4 Functional Clock Divider, array offset: 0xA00, array step: 0x4 */
       uint8_t RESERVED_23[140];
  __IO uint32_t CTIMERFCLKSEL[CLKCTL0_CTIMERNFCLKSEL_COUNT]; /**< CTIMER0 Functional Clock Source Select..CTIMER4 Functional Clock Source Select, array offset: 0xAA0, array step: 0x4 */
       uint8_t RESERVED_24[12];
  __IO uint32_t TRNGFCLKSEL;                       /**< TRNG Functional Clock Source Select, offset: 0xAC0 */
  __IO uint32_t TRNGFCLKDIV;                       /**< TRNG FCLK Clock Divider, offset: 0xAC4 */
       uint8_t RESERVED_25[56];
  __IO uint32_t I3C01FCLKSEL;                      /**< I3C0 and I3C1 Functional Clock Source Select, offset: 0xB00 */
  __IO uint32_t I3C01PCLKSEL;                      /**< I3C0 and I3C1 P-CLK Source Select, offset: 0xB04 */
  __IO uint32_t I3C01PCLKDIV;                      /**< I3C0 and I3C1 P-CLK Divider, offset: 0xB08 */
       uint8_t RESERVED_26[4];
  __IO uint32_t I3C01FCLKDIV;                      /**< I3C0 and I3C1 Functional Clock Divider, offset: 0xB10 */
       uint8_t RESERVED_27[12];
  __IO uint32_t CLKOUTCLKSEL;                      /**< CLKOUT_VDD2 Clock Select Source, offset: 0xB20 */
  __IO uint32_t CLKOUTCLKDIV;                      /**< CLKOUT_VDD2 Clock Divider, offset: 0xB24 */
       uint8_t RESERVED_28[8];
  __IO uint32_t AUDIOVDD2CLKSEL;                   /**< VDD2_COMP Audio Clock Source Select, offset: 0xB30 */
} CLKCTL0_Type;

/* ----------------------------------------------------------------------------
   -- CLKCTL0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL0_Register_Masks CLKCTL0 Register Masks
 * @{
 */

