solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL1_QK_SUBSYS_MASK           (0x4000U)
#define CLKCTL0_PSCCTL1_QK_SUBSYS_SHIFT          (14U)
/*! QK_SUBSYS - QK SUBSYS (PUF_CTRL) Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_QK_SUBSYS(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_QK_SUBSYS_SHIFT)) & CLKCTL0_PSCCTL1_QK_SUBSYS_MASK)

#define CLKCTL0_PSCCTL1_MMU0_MASK                (0x10000U)
#define CLKCTL0_PSCCTL1_MMU0_SHIFT               (16U)
/*! MMU0 - MMU0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_MMU0(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_MMU0_SHIFT)) & CLKCTL0_PSCCTL1_MMU0_MASK)

#define CLKCTL0_PSCCTL1_MMU1_MASK                (0x20000U)
#define CLKCTL0_PSCCTL1_MMU1_SHIFT               (17U)
/*! MMU1 - MMU1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_MMU1(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_MMU1_SHIFT)) & CLKCTL0_PSCCTL1_MMU1_MASK)

#define CLKCTL0_PSCCTL1_GPIO0_MASK               (0x40000U)
#define CLKCTL0_PSCCTL1_GPIO0_SHIFT              (18U)
/*! GPIO0 - GPIO0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_GPIO0(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_GPIO0_SHIFT)) & CLKCTL0_PSCCTL1_GPIO0_MASK)

#define CLKCTL0_PSCCTL1_GPIO1_MASK               (0x80000U)
#define CLKCTL0_PSCCTL1_GPIO1_SHIFT              (19U)
/*! GPIO1 - GPIO1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_GPIO1(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_GPIO1_SHIFT)) & CLKCTL0_PSCCTL1_GPIO1_MASK)

#define CLKCTL0_PSCCTL1_GPIO2_MASK               (0x100000U)
#define CLKCTL0_PSCCTL1_GPIO2_SHIFT              (20U)
/*! GPIO2 - GPIO2 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_GPIO2(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_GPIO2_SHIFT)) & CLKCTL0_PSCCTL1_GPIO2_MASK)

#define CLKCTL0_PSCCTL1_GPIO3_MASK               (0x200000U)
#define CLKCTL0_PSCCTL1_GPIO3_SHIFT              (21U)
/*! GPIO3 - GPIO3 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_GPIO3(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_GPIO3_SHIFT)) & CLKCTL0_PSCCTL1_GPIO3_MASK)

#define CLKCTL0_PSCCTL1_GPIO4_MASK               (0x400000U)
#define CLKCTL0_PSCCTL1_GPIO4_SHIFT              (22U)
/*! GPIO4 - GPIO4 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_GPIO4(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_GPIO4_SHIFT)) & CLKCTL0_PSCCTL1_GPIO4_MASK)

#define CLKCTL0_PSCCTL1_GPIO5_MASK               (0x800000U)
#define CLKCTL0_PSCCTL1_GPIO5_SHIFT              (23U)
/*! GPIO5 - GPIO5 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_GPIO5(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_GPIO5_SHIFT)) & CLKCTL0_PSCCTL1_GPIO5_MASK)

#define CLKCTL0_PSCCTL1_GPIO6_MASK               (0x1000000U)
#define CLKCTL0_PSCCTL1_GPIO6_SHIFT              (24U)
/*! GPIO6 - GPIO6 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_GPIO6(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_GPIO6_SHIFT)) & CLKCTL0_PSCCTL1_GPIO6_MASK)

#define CLKCTL0_PSCCTL1_GPIO7_MASK               (0x2000000U)
#define CLKCTL0_PSCCTL1_GPIO7_SHIFT              (25U)
/*! GPIO7 - GPIO7 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_GPIO7(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_GPIO7_SHIFT)) & CLKCTL0_PSCCTL1_GPIO7_MASK)

#define CLKCTL0_PSCCTL1_SCT0_MASK                (0x4000000U)
#define CLKCTL0_PSCCTL1_SCT0_SHIFT               (26U)
/*! SCT0 - SCT0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SCT0(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SCT0_SHIFT)) & CLKCTL0_PSCCTL1_SCT0_MASK)

#define CLKCTL0_PSCCTL1_CDOG0_MASK               (0x8000000U)
#define CLKCTL0_PSCCTL1_CDOG0_SHIFT              (27U)
/*! CDOG0 - CDOG0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_CDOG0(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_CDOG0_SHIFT)) & CLKCTL0_PSCCTL1_CDOG0_MASK)

#define CLKCTL0_PSCCTL1_CDOG1_MASK               (0x10000000U)
#define CLKCTL0_PSCCTL1_CDOG1_SHIFT              (28U)
/*! CDOG1 - CDOG1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_CDOG1(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_CDOG1_SHIFT)) & CLKCTL0_PSCCTL1_CDOG1_MASK)

#define CLKCTL0_PSCCTL1_CDOG2_MASK               (0x20000000U)
#define CLKCTL0_PSCCTL1_CDOG2_SHIFT              (29U)
/*! CDOG2 - CDOG2 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_CDOG2(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_CDOG2_SHIFT)) & CLKCTL0_PSCCTL1_CDOG2_MASK)

#define CLKCTL0_PSCCTL1_LP_FLEXCOMM0_MASK        (0x40000000U)
#define CLKCTL0_PSCCTL1_LP_FLEXCOMM0_SHIFT       (30U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_LP_FLEXCOMM0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_LP_FLEXCOMM0_SHIFT)) & CLKCTL0_PSCCTL1_LP_FLEXCOMM0_MASK)

#define CLKCTL0_PSCCTL1_LP_FLEXCOMM1_MASK        (0x80000000U)
#define CLKCTL0_PSCCTL1_LP_FLEXCOMM1_SHIFT       (31U)
/*! LP_FLEXCOMM1 - LP_FLEXCOMM1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_LP_FLEXCOMM1(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_LP_FLEXCOMM1_SHIFT)) & CLKCTL0_PSCCTL1_LP_FLEXCOMM1_MASK)
/*! @} */

/*! @name PSCCTL2 - VDD2_COMP Peripheral Clock Control 2 */
/*! @{ */

#define CLKCTL0_PSCCTL2_LP_FLEXCOMM2_MASK        (0x1U)
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM2_SHIFT       (0U)
/*! LP_FLEXCOMM2 - LP_FLEXCOMM2 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM2(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_LP_FLEXCOMM2_SHIFT)) & CLKCTL0_PSCCTL2_LP_FLEXCOMM2_MASK)

#define CLKCTL0_PSCCTL2_LP_FLEXCOMM3_MASK        (0x2U)
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM3_SHIFT       (1U)
/*! LP_FLEXCOMM3 - LP_FLEXCOMM3 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM3(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_LP_FLEXCOMM3_SHIFT)) & CLKCTL0_PSCCTL2_LP_FLEXCOMM3_MASK)

#define CLKCTL0_PSCCTL2_LP_FLEXCOMM4_MASK        (0x4U)
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM4_SHIFT       (2U)
/*! LP_FLEXCOMM4 - LP_FLEXCOMM4 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM4(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_LP_FLEXCOMM4_SHIFT)) & CLKCTL0_PSCCTL2_LP_FLEXCOMM4_MASK)

#define CLKCTL0_PSCCTL2_LP_FLEXCOMM5_MASK        (0x8U)
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM5_SHIFT       (3U)
/*! LP_FLEXCOMM5 - LP_FLEXCOMM5 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM5(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_LP_FLEXCOMM5_SHIFT)) & CLKCTL0_PSCCTL2_LP_FLEXCOMM5_MASK)

#define CLKCTL0_PSCCTL2_LP_FLEXCOMM6_MASK        (0x10U)
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM6_SHIFT       (4U)
/*! LP_FLEXCOMM6 - LP_FLEXCOMM6 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM6(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_LP_FLEXCOMM6_SHIFT)) & CLKCTL0_PSCCTL2_LP_FLEXCOMM6_MASK)

#define CLKCTL0_PSCCTL2_LP_FLEXCOMM7_MASK        (0x20U)
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM7_SHIFT       (5U)
/*! LP_FLEXCOMM7 - LP_FLEXCOMM7 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_LP_FLEXCOMM7(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_LP_FLEXCOMM7_SHIFT)) & CLKCTL0_PSCCTL2_LP_FLEXCOMM7_MASK)

