solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL2_CTIMER4_MASK             (0x2000000U)
#define CLKCTL0_PSCCTL2_CTIMER4_SHIFT            (25U)
/*! CTIMER4 - CTIMER4 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_CTIMER4(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_CTIMER4_SHIFT)) & CLKCTL0_PSCCTL2_CTIMER4_MASK)

#define CLKCTL0_PSCCTL2_MRT0_MASK                (0x4000000U)
#define CLKCTL0_PSCCTL2_MRT0_SHIFT               (26U)
/*! MRT0 - MRT0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_MRT0(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_MRT0_SHIFT)) & CLKCTL0_PSCCTL2_MRT0_MASK)

#define CLKCTL0_PSCCTL2_UTICK0_MASK              (0x8000000U)
#define CLKCTL0_PSCCTL2_UTICK0_SHIFT             (27U)
/*! UTICK0 - UTICK0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_UTICK0(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_UTICK0_SHIFT)) & CLKCTL0_PSCCTL2_UTICK0_MASK)

#define CLKCTL0_PSCCTL2_SEMA42_4_MASK            (0x40000000U)
#define CLKCTL0_PSCCTL2_SEMA42_4_SHIFT           (30U)
/*! SEMA42_4 - SEMA42_4 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SEMA42_4(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SEMA42_4_SHIFT)) & CLKCTL0_PSCCTL2_SEMA42_4_MASK)

#define CLKCTL0_PSCCTL2_MU4_MASK                 (0x80000000U)
#define CLKCTL0_PSCCTL2_MU4_SHIFT                (31U)
/*! MU4 - MU4 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_MU4(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_MU4_SHIFT)) & CLKCTL0_PSCCTL2_MU4_MASK)
/*! @} */

/*! @name PSCCTL3 - VDD2_COMP Peripheral Clock Control 3 */
/*! @{ */

#define CLKCTL0_PSCCTL3_PINT0_MASK               (0x20U)
#define CLKCTL0_PSCCTL3_PINT0_SHIFT              (5U)
/*! PINT0 - PINT0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_PINT0(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_PINT0_SHIFT)) & CLKCTL0_PSCCTL3_PINT0_MASK)

#define CLKCTL0_PSCCTL3_FREQME0_MASK             (0x100U)
#define CLKCTL0_PSCCTL3_FREQME0_SHIFT            (8U)
/*! FREQME0 - FREQME0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_FREQME0(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_FREQME0_SHIFT)) & CLKCTL0_PSCCTL3_FREQME0_MASK)

#define CLKCTL0_PSCCTL3_INPUTMUX0_MASK           (0x400U)
#define CLKCTL0_PSCCTL3_INPUTMUX0_SHIFT          (10U)
/*! INPUTMUX0 - INPUTMUX0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_INPUTMUX0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_INPUTMUX0_SHIFT)) & CLKCTL0_PSCCTL3_INPUTMUX0_MASK)

#define CLKCTL0_PSCCTL3_SAFO_SGI_MASK            (0x1000U)
#define CLKCTL0_PSCCTL3_SAFO_SGI_SHIFT           (12U)
/*! SAFO_SGI - SAFO_SGI Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SAFO_SGI(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SAFO_SGI_SHIFT)) & CLKCTL0_PSCCTL3_SAFO_SGI_MASK)

#define CLKCTL0_PSCCTL3_TRACE_MASK               (0x2000U)
#define CLKCTL0_PSCCTL3_TRACE_SHIFT              (13U)
/*! TRACE - TRACE_RT700 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_TRACE(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_TRACE_SHIFT)) & CLKCTL0_PSCCTL3_TRACE_MASK)

#define CLKCTL0_PSCCTL3_PRINCE0_MASK             (0x8000U)
#define CLKCTL0_PSCCTL3_PRINCE0_SHIFT            (15U)
/*! PRINCE0 - PRINCE0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_PRINCE0(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_PRINCE0_SHIFT)) & CLKCTL0_PSCCTL3_PRINCE0_MASK)

#define CLKCTL0_PSCCTL3_PRINCE1_MASK             (0x10000U)
#define CLKCTL0_PSCCTL3_PRINCE1_SHIFT            (16U)
/*! PRINCE1 - PRINCE1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_PRINCE1(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_PRINCE1_SHIFT)) & CLKCTL0_PSCCTL3_PRINCE1_MASK)

#define CLKCTL0_PSCCTL3_XSPI1_PRINCE_XEX_MASK    (0x20000U)
#define CLKCTL0_PSCCTL3_XSPI1_PRINCE_XEX_SHIFT   (17U)
/*! XSPI1_PRINCE_XEX - XSPI1 PRINCE_XEX Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_XSPI1_PRINCE_XEX(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_XSPI1_PRINCE_XEX_SHIFT)) & CLKCTL0_PSCCTL3_XSPI1_PRINCE_XEX_MASK)

#define CLKCTL0_PSCCTL3_CMX_PERFMON0_MASK        (0x40000U)
#define CLKCTL0_PSCCTL3_CMX_PERFMON0_SHIFT       (18U)
/*! CMX_PERFMON0 - CMX_PERFMON0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_CMX_PERFMON0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CMX_PERFMON0_SHIFT)) & CLKCTL0_PSCCTL3_CMX_PERFMON0_MASK)

#define CLKCTL0_PSCCTL3_CMX_PERFMON1_MASK        (0x80000U)
#define CLKCTL0_PSCCTL3_CMX_PERFMON1_SHIFT       (19U)
/*! CMX_PERFMON1 - CMX_PERFMON1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_CMX_PERFMON1(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_CMX_PERFMON1_SHIFT)) & CLKCTL0_PSCCTL3_CMX_PERFMON1_MASK)
/*! @} */

/*! @name PSCCTL4 - VDD2_COMP Peripheral Clock Control 4 */
/*! @{ */

#define CLKCTL0_PSCCTL4_HIFI4_MASK               (0x1U)
#define CLKCTL0_PSCCTL4_HIFI4_SHIFT              (0U)
/*! HiFi4 - HiFi4 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL4_HIFI4(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL4_HIFI4_SHIFT)) & CLKCTL0_PSCCTL4_HIFI4_MASK)
/*! @} */

/*! @name PSCCTL5 - VDD2_COMP Peripheral Clock Control 5 */
/*! @{ */

#define CLKCTL0_PSCCTL5_NPU0_MASK                (0x1U)
#define CLKCTL0_PSCCTL5_NPU0_SHIFT               (0U)
/*! NPU0 - NPU0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL5_NPU0(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_NPU0_SHIFT)) & CLKCTL0_PSCCTL5_NPU0_MASK)

#define CLKCTL0_PSCCTL5_COMP_ACCESS_RAM_ARBITER1_MASK (0x4U)
#define CLKCTL0_PSCCTL5_COMP_ACCESS_RAM_ARBITER1_SHIFT (2U)
/*! COMP_ACCESS_RAM_ARBITER1 - VDD2_COMP Access RAM Arbiter1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL5_COMP_ACCESS_RAM_ARBITER1(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_COMP_ACCESS_RAM_ARBITER1_SHIFT)) & CLKCTL0_PSCCTL5_COMP_ACCESS_RAM_ARBITER1_MASK)

