solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL1_SET_CDOG1_MASK           (0x10000000U)
#define CLKCTL0_PSCCTL1_SET_CDOG1_SHIFT          (28U)
/*! CDOG1 - CDOG1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_CDOG1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_CDOG1_SHIFT)) & CLKCTL0_PSCCTL1_SET_CDOG1_MASK)

#define CLKCTL0_PSCCTL1_SET_CDOG2_MASK           (0x20000000U)
#define CLKCTL0_PSCCTL1_SET_CDOG2_SHIFT          (29U)
/*! CDOG2 - CDOG2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_CDOG2(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_CDOG2_SHIFT)) & CLKCTL0_PSCCTL1_SET_CDOG2_MASK)

#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0_MASK    (0x40000000U)
#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0_SHIFT   (30U)
/*! LP_FLEXCOMM0 - LP_FLEXCOMM0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0_SHIFT)) & CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM0_MASK)

#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1_MASK    (0x80000000U)
#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1_SHIFT   (31U)
/*! LP_FLEXCOMM1 - LP_FLEXCOMM1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1_SHIFT)) & CLKCTL0_PSCCTL1_SET_LP_FLEXCOMM1_MASK)
/*! @} */

/*! @name PSCCTL2_SET - VDD2_COMP Peripheral Clock Control 2 Set */
/*! @{ */

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2_MASK    (0x1U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2_SHIFT   (0U)
/*! LP_FLEXCOMM2 - LP_FLEXCOMM2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM2_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3_MASK    (0x2U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3_SHIFT   (1U)
/*! LP_FLEXCOMM3 - LP_FLEXCOMM3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM3_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4_MASK    (0x4U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4_SHIFT   (2U)
/*! LP_FLEXCOMM4 - LP_FLEXCOMM4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM4_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5_MASK    (0x8U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5_SHIFT   (3U)
/*! LP_FLEXCOMM5 - LP_FLEXCOMM5 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM5_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6_MASK    (0x10U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6_SHIFT   (4U)
/*! LP_FLEXCOMM6 - LP_FLEXCOMM6 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM6_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7_MASK    (0x20U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7_SHIFT   (5U)
/*! LP_FLEXCOMM7 - LP_FLEXCOMM7 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM7_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8_MASK    (0x40U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8_SHIFT   (6U)
/*! LP_FLEXCOMM8 - LP_FLEXCOMM8 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM8_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9_MASK    (0x80U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9_SHIFT   (7U)
/*! LP_FLEXCOMM9 - LP_FLEXCOMM9 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM9_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10_MASK   (0x100U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10_SHIFT  (8U)
/*! LP_FLEXCOMM10 - LP_FLEXCOMM10 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM10_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11_MASK   (0x200U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11_SHIFT  (9U)
/*! LP_FLEXCOMM11 - LP_FLEXCOMM11 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM11_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12_MASK   (0x400U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12_SHIFT  (10U)
/*! LP_FLEXCOMM12 - LP_FLEXCOMM12 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM12_MASK)

#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13_MASK   (0x800U)
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13_SHIFT  (11U)
/*! LP_FLEXCOMM13 - LP_FLEXCOMM13 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13_SHIFT)) & CLKCTL0_PSCCTL2_SET_LP_FLEXCOMM13_MASK)

#define CLKCTL0_PSCCTL2_SET_SAI0_MASK            (0x2000U)
#define CLKCTL0_PSCCTL2_SET_SAI0_SHIFT           (13U)
/*! SAI0 - SAI0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_SAI0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_SAI0_SHIFT)) & CLKCTL0_PSCCTL2_SET_SAI0_MASK)

#define CLKCTL0_PSCCTL2_SET_SAI1_MASK            (0x4000U)
#define CLKCTL0_PSCCTL2_SET_SAI1_SHIFT           (14U)
/*! SAI1 - SAI1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_SAI1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_SAI1_SHIFT)) & CLKCTL0_PSCCTL2_SET_SAI1_MASK)

#define CLKCTL0_PSCCTL2_SET_SAI2_MASK            (0x8000U)
#define CLKCTL0_PSCCTL2_SET_SAI2_SHIFT           (15U)
/*! SAI2 - SAI2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_SAI2(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_SAI2_SHIFT)) & CLKCTL0_PSCCTL2_SET_SAI2_MASK)

