solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL2_SET_I3C0_MASK            (0x10000U)
#define CLKCTL0_PSCCTL2_SET_I3C0_SHIFT           (16U)
/*! I3C0 - I3C0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_I3C0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_I3C0_SHIFT)) & CLKCTL0_PSCCTL2_SET_I3C0_MASK)

#define CLKCTL0_PSCCTL2_SET_I3C1_MASK            (0x20000U)
#define CLKCTL0_PSCCTL2_SET_I3C1_SHIFT           (17U)
/*! I3C1 - I3C1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_I3C1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_I3C1_SHIFT)) & CLKCTL0_PSCCTL2_SET_I3C1_MASK)

#define CLKCTL0_PSCCTL2_SET_CRC0_MASK            (0x40000U)
#define CLKCTL0_PSCCTL2_SET_CRC0_SHIFT           (18U)
/*! CRC0 - CRC0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CRC0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CRC0_SHIFT)) & CLKCTL0_PSCCTL2_SET_CRC0_MASK)

#define CLKCTL0_PSCCTL2_SET_WWDT0_MASK           (0x80000U)
#define CLKCTL0_PSCCTL2_SET_WWDT0_SHIFT          (19U)
/*! WWDT0 - WWDT0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_WWDT0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_WWDT0_SHIFT)) & CLKCTL0_PSCCTL2_SET_WWDT0_MASK)

#define CLKCTL0_PSCCTL2_SET_WWDT1_MASK           (0x100000U)
#define CLKCTL0_PSCCTL2_SET_WWDT1_SHIFT          (20U)
/*! WWDT1 - WWDT1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_WWDT1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_WWDT1_SHIFT)) & CLKCTL0_PSCCTL2_SET_WWDT1_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER0_MASK         (0x200000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER0_SHIFT        (21U)
/*! CTIMER0 - CTIMER0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER0_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER0_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER1_MASK         (0x400000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER1_SHIFT        (22U)
/*! CTIMER1 - CTIMER1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER1(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER1_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER1_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER2_MASK         (0x800000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER2_SHIFT        (23U)
/*! CTIMER2 - CTIMER2 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER2(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER2_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER2_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER3_MASK         (0x1000000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER3_SHIFT        (24U)
/*! CTIMER3 - CTIMER3 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER3(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER3_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER3_MASK)

#define CLKCTL0_PSCCTL2_SET_CTIMER4_MASK         (0x2000000U)
#define CLKCTL0_PSCCTL2_SET_CTIMER4_SHIFT        (25U)
/*! CTIMER4 - CTIMER4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_CTIMER4(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_CTIMER4_SHIFT)) & CLKCTL0_PSCCTL2_SET_CTIMER4_MASK)

#define CLKCTL0_PSCCTL2_SET_MRT0_MASK            (0x4000000U)
#define CLKCTL0_PSCCTL2_SET_MRT0_SHIFT           (26U)
/*! MRT0 - MRT0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_MRT0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_MRT0_SHIFT)) & CLKCTL0_PSCCTL2_SET_MRT0_MASK)

#define CLKCTL0_PSCCTL2_SET_UTICK0_MASK          (0x8000000U)
#define CLKCTL0_PSCCTL2_SET_UTICK0_SHIFT         (27U)
/*! UTICK0 - UTICK0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_UTICK0(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_UTICK0_SHIFT)) & CLKCTL0_PSCCTL2_SET_UTICK0_MASK)

#define CLKCTL0_PSCCTL2_SET_SEMA42_4_MASK        (0x40000000U)
#define CLKCTL0_PSCCTL2_SET_SEMA42_4_SHIFT       (30U)
/*! SEMA42_4 - SEMA42_4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_SEMA42_4(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_SEMA42_4_SHIFT)) & CLKCTL0_PSCCTL2_SET_SEMA42_4_MASK)

#define CLKCTL0_PSCCTL2_SET_MU4_MASK             (0x80000000U)
#define CLKCTL0_PSCCTL2_SET_MU4_SHIFT            (31U)
/*! MU4 - MU4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL2_SET_MU4(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_MU4_SHIFT)) & CLKCTL0_PSCCTL2_SET_MU4_MASK)
/*! @} */

/*! @name PSCCTL3_SET - VDD2_COMP Peripheral Clock Control 3 Set */
/*! @{ */

#define CLKCTL0_PSCCTL3_SET_PINT0_MASK           (0x20U)
#define CLKCTL0_PSCCTL3_SET_PINT0_SHIFT          (5U)
/*! PINT0 - PINT0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_PINT0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_PINT0_SHIFT)) & CLKCTL0_PSCCTL3_SET_PINT0_MASK)

#define CLKCTL0_PSCCTL3_SET_FREQME0_MASK         (0x100U)
#define CLKCTL0_PSCCTL3_SET_FREQME0_SHIFT        (8U)
/*! FREQME0 - FREQME0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_FREQME0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_FREQME0_SHIFT)) & CLKCTL0_PSCCTL3_SET_FREQME0_MASK)

#define CLKCTL0_PSCCTL3_SET_INPUTMUX0_MASK       (0x400U)
#define CLKCTL0_PSCCTL3_SET_INPUTMUX0_SHIFT      (10U)
/*! INPUTMUX0 - INPUTMUX0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_INPUTMUX0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_INPUTMUX0_SHIFT)) & CLKCTL0_PSCCTL3_SET_INPUTMUX0_MASK)

#define CLKCTL0_PSCCTL3_SET_SAFO_SGI_MASK        (0x1000U)
#define CLKCTL0_PSCCTL3_SET_SAFO_SGI_SHIFT       (12U)
/*! SAFO_SGI - SAFO_SGI Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_SAFO_SGI(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_SAFO_SGI_SHIFT)) & CLKCTL0_PSCCTL3_SET_SAFO_SGI_MASK)

#define CLKCTL0_PSCCTL3_SET_TRACE_MASK           (0x2000U)
#define CLKCTL0_PSCCTL3_SET_TRACE_SHIFT          (13U)
/*! TRACE - TRACE_RT700 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_TRACE(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_TRACE_SHIFT)) & CLKCTL0_PSCCTL3_SET_TRACE_MASK)

