solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
#define CLKCTL0_PSCCTL3_SET_PRINCE0_MASK         (0x8000U)
#define CLKCTL0_PSCCTL3_SET_PRINCE0_SHIFT        (15U)
/*! PRINCE0 - PRINCE0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_PRINCE0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_PRINCE0_SHIFT)) & CLKCTL0_PSCCTL3_SET_PRINCE0_MASK)

#define CLKCTL0_PSCCTL3_SET_PRINCE1_MASK         (0x10000U)
#define CLKCTL0_PSCCTL3_SET_PRINCE1_SHIFT        (16U)
/*! PRINCE1 - PRINCE1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_PRINCE1(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_PRINCE1_SHIFT)) & CLKCTL0_PSCCTL3_SET_PRINCE1_MASK)

#define CLKCTL0_PSCCTL3_SET_XSPI1_PRINCE_XEX_MASK (0x20000U)
#define CLKCTL0_PSCCTL3_SET_XSPI1_PRINCE_XEX_SHIFT (17U)
/*! XSPI1_PRINCE_XEX - XSPI1_PRINCE XEX Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_XSPI1_PRINCE_XEX(x)  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_XSPI1_PRINCE_XEX_SHIFT)) & CLKCTL0_PSCCTL3_SET_XSPI1_PRINCE_XEX_MASK)

#define CLKCTL0_PSCCTL3_SET_CMX_PERFMON0_MASK    (0x40000U)
#define CLKCTL0_PSCCTL3_SET_CMX_PERFMON0_SHIFT   (18U)
/*! CMX_PERFMON0 - CMX_PERFMON0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_CMX_PERFMON0(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_CMX_PERFMON0_SHIFT)) & CLKCTL0_PSCCTL3_SET_CMX_PERFMON0_MASK)

#define CLKCTL0_PSCCTL3_SET_CMX_PERFMON1_MASK    (0x80000U)
#define CLKCTL0_PSCCTL3_SET_CMX_PERFMON1_SHIFT   (19U)
/*! CMX_PERFMON1 - CMX_PERFMON1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL3_SET_CMX_PERFMON1(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL3_SET_CMX_PERFMON1_SHIFT)) & CLKCTL0_PSCCTL3_SET_CMX_PERFMON1_MASK)
/*! @} */

/*! @name PSCCTL4_SET - VDD2_COMP Peripheral Clock Control 4 Set */
/*! @{ */

#define CLKCTL0_PSCCTL4_SET_HIFI4_MASK           (0x1U)
#define CLKCTL0_PSCCTL4_SET_HIFI4_SHIFT          (0U)
/*! HiFi4 - HiFi4 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL4_SET_HIFI4(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL4_SET_HIFI4_SHIFT)) & CLKCTL0_PSCCTL4_SET_HIFI4_MASK)
/*! @} */

/*! @name PSCCTL5_SET - VDD2_COMP Peripheral Clock Control 5 Set */
/*! @{ */

#define CLKCTL0_PSCCTL5_SET_NPU0_MASK            (0x1U)
#define CLKCTL0_PSCCTL5_SET_NPU0_SHIFT           (0U)
/*! NPU0 - NPU0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL5_SET_NPU0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_SET_NPU0_SHIFT)) & CLKCTL0_PSCCTL5_SET_NPU0_MASK)

#define CLKCTL0_PSCCTL5_SET_COMP_ACCESS_RAM_ARBITER1_MASK (0x4U)
#define CLKCTL0_PSCCTL5_SET_COMP_ACCESS_RAM_ARBITER1_SHIFT (2U)
/*! COMP_ACCESS_RAM_ARBITER1 - VDD2_COMP Access RAM Arbiter1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL5_SET_COMP_ACCESS_RAM_ARBITER1(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_SET_COMP_ACCESS_RAM_ARBITER1_SHIFT)) & CLKCTL0_PSCCTL5_SET_COMP_ACCESS_RAM_ARBITER1_MASK)

#define CLKCTL0_PSCCTL5_SET_IOPCTL0_MASK         (0x8U)
#define CLKCTL0_PSCCTL5_SET_IOPCTL0_SHIFT        (3U)
/*! IOPCTL0 - IOPCTL0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL5_SET_IOPCTL0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_SET_IOPCTL0_SHIFT)) & CLKCTL0_PSCCTL5_SET_IOPCTL0_MASK)

#define CLKCTL0_PSCCTL5_SET_HIFI4_ACCESS_RAM_ARBITER1_MASK (0x10U)
#define CLKCTL0_PSCCTL5_SET_HIFI4_ACCESS_RAM_ARBITER1_SHIFT (4U)
/*! HiFi4_ACCESS_RAM_ARBITER1 - HiFi4 Access RAM Arbiter1 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL5_SET_HIFI4_ACCESS_RAM_ARBITER1(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_SET_HIFI4_ACCESS_RAM_ARBITER1_SHIFT)) & CLKCTL0_PSCCTL5_SET_HIFI4_ACCESS_RAM_ARBITER1_MASK)

#define CLKCTL0_PSCCTL5_SET_MEDIA_ACCESS_RAM_ARBITER0_MASK (0x20U)
#define CLKCTL0_PSCCTL5_SET_MEDIA_ACCESS_RAM_ARBITER0_SHIFT (5U)
/*! MEDIA_ACCESS_RAM_ARBITER0 - VDD2_Media Access RAM Arbiter 0 Clock
 *  0b0..No effect
 *  0b1..Enable
 */
#define CLKCTL0_PSCCTL5_SET_MEDIA_ACCESS_RAM_ARBITER0(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL5_SET_MEDIA_ACCESS_RAM_ARBITER0_SHIFT)) & CLKCTL0_PSCCTL5_SET_MEDIA_ACCESS_RAM_ARBITER0_MASK)
/*! @} */

/*! @name PSCCTL0_CLR - VDD2_COMP Peripheral Clock Control 0 Clear */
/*! @{ */

#define CLKCTL0_PSCCTL0_CLR_CODE_CACHE_MASK      (0x2U)
#define CLKCTL0_PSCCTL0_CLR_CODE_CACHE_SHIFT     (1U)
/*! CODE_CACHE - CODE CACHE (XCACHE1) Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL0_CLR_CODE_CACHE(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_CLR_CODE_CACHE_SHIFT)) & CLKCTL0_PSCCTL0_CLR_CODE_CACHE_MASK)

#define CLKCTL0_PSCCTL0_CLR_SYSTEM_CACHE_MASK    (0x4U)
#define CLKCTL0_PSCCTL0_CLR_SYSTEM_CACHE_SHIFT   (2U)
/*! SYSTEM_CACHE - SYSTEM CACHE (XCACHE0)Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL0_CLR_SYSTEM_CACHE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_CLR_SYSTEM_CACHE_SHIFT)) & CLKCTL0_PSCCTL0_CLR_SYSTEM_CACHE_MASK)

#define CLKCTL0_PSCCTL0_CLR_VDD2_OTP0_MASK       (0x20U)
#define CLKCTL0_PSCCTL0_CLR_VDD2_OTP0_SHIFT      (5U)
/*! VDD2_OTP0 - VDD2_OTP_CTRL0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL0_CLR_VDD2_OTP0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_CLR_VDD2_OTP0_SHIFT)) & CLKCTL0_PSCCTL0_CLR_VDD2_OTP0_MASK)

#define CLKCTL0_PSCCTL0_CLR_SLEEPCON0_MASK       (0x1000U)
#define CLKCTL0_PSCCTL0_CLR_SLEEPCON0_SHIFT      (12U)
/*! SLEEPCON0 - SLEEPCON0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL0_CLR_SLEEPCON0(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_CLR_SLEEPCON0_SHIFT)) & CLKCTL0_PSCCTL0_CLR_SLEEPCON0_MASK)

#define CLKCTL0_PSCCTL0_CLR_SYSCON0_MASK         (0x2000U)
#define CLKCTL0_PSCCTL0_CLR_SYSCON0_SHIFT        (13U)
/*! SYSCON0 - SYSCON0 Clock
 *  0b0..No effect
 *  0b1..Disable
 */
#define CLKCTL0_PSCCTL0_CLR_SYSCON0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_CLR_SYSCON0_SHIFT)) & CLKCTL0_PSCCTL0_CLR_SYSCON0_MASK)

