solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
#define CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_MASK  (0x2U)
#define CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_SHIFT (1U)
/*! FRO0_CLK_OK - FRO_TUNER0 Clock OK
 *  0b0..FRO_TUNER0 clock has not yet reached its final frequency.
 *  0b1..FRO_TUNER0 clock has reached its final frequency.
 */
#define CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_SHIFT)) & CLKCTL0_FRO01CLKSTATUS_FRO0_CLK_OK_MASK)
/*! @} */

/*! @name FRO0MAXDOMAINEN - FRO0MAX Clock Domain Enable */
/*! @{ */

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT_MASK (0x1U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT_SHIFT (0U)
/*! FRO0MAX_OF_CMPT - fro0_max Clock of VDD2_COMP
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_CMPT_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE_MASK (0x2U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE_SHIFT (1U)
/*! FRO0MAX_OF_SENSE - fro0_max Clock of VDD1_SENSE Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_SENSE_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_MASK (0x4U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_SHIFT (2U)
/*! FRO0MAX_OF_VDD2_DSP - fro0_max Clock of VDD2_DSP Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_DSP_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2_MASK (0x8U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2_SHIFT (3U)
/*! FRO0MAX_OF_MD2 - fro0_max Clock of VDD2_MEDIA Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MD2_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN_MASK (0x10U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN_SHIFT (4U)
/*! FRO0MAX_OF_MDN - fro0_max Clock of VDDN_MEDIA Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_MDN_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM_MASK (0x20U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM_SHIFT (5U)
/*! FRO0MAX_OF_VDD2_COM - fro0_max Clock of VDD2_COM Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_VDD2_COM_MASK)

#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_COMN_MASK (0x40U)
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_COMN_SHIFT (6U)
/*! FRO0MAX_OF_COMN - fro0_max Clock of VDDN_COM Domain
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_COMN(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_COMN_SHIFT)) & CLKCTL0_FRO0MAXDOMAINEN_FRO0MAX_OF_COMN_MASK)
/*! @} */

/*! @name MAINCLKDIV - VDD2_COMP Main Clock Divider */
/*! @{ */

#define CLKCTL0_MAINCLKDIV_DIV_MASK              (0xFFU)
#define CLKCTL0_MAINCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_MAINCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_MAINCLKDIV_DIV_SHIFT)) & CLKCTL0_MAINCLKDIV_DIV_MASK)

#define CLKCTL0_MAINCLKDIV_BUSY_MASK             (0x10000000U)
#define CLKCTL0_MAINCLKDIV_BUSY_SHIFT            (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_MAINCLKDIV_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_MAINCLKDIV_BUSY_SHIFT)) & CLKCTL0_MAINCLKDIV_BUSY_MASK)

#define CLKCTL0_MAINCLKDIV_REQFLAG_MASK          (0x80000000U)
#define CLKCTL0_MAINCLKDIV_REQFLAG_SHIFT         (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_MAINCLKDIV_REQFLAG(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_MAINCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_MAINCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name CMPTBASECLKSEL - VDD2_COMP Base Clock Select Source */
/*! @{ */

#define CLKCTL0_CMPTBASECLKSEL_SEL_MASK          (0x3U)
#define CLKCTL0_CMPTBASECLKSEL_SEL_SHIFT         (0U)
/*! SEL - VDD2_COMP Base Clock Select Source
 *  0b00..fro1_div3
 *  0b01..fro1_max
 *  0b10..fro0_div3
 *  0b11..1m_lposc
 */
#define CLKCTL0_CMPTBASECLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CMPTBASECLKSEL_SEL_SHIFT)) & CLKCTL0_CMPTBASECLKSEL_SEL_MASK)
/*! @} */

/*! @name DSPBASECLKSEL - VDD2_DSP Base Clock Select Source */
/*! @{ */

#define CLKCTL0_DSPBASECLKSEL_SEL_MASK           (0x3U)
#define CLKCTL0_DSPBASECLKSEL_SEL_SHIFT          (0U)
/*! SEL - VDD2_DSP Base Clock Select Source
 *  0b00..fro1_div3
 *  0b01..fro1_max
 *  0b10..fro0_div3
 *  0b11..1m_lposc
 */
#define CLKCTL0_DSPBASECLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_DSPBASECLKSEL_SEL_SHIFT)) & CLKCTL0_DSPBASECLKSEL_SEL_MASK)
/*! @} */

/*! @name VDD2COMBASECLKSEL - VDD2_COM Base Clock Select Source */
/*! @{ */

#define CLKCTL0_VDD2COMBASECLKSEL_SEL_MASK       (0x3U)
#define CLKCTL0_VDD2COMBASECLKSEL_SEL_SHIFT      (0U)
/*! SEL - VDD2_COM Base Clock Select Source
 *  0b00..fro1_div3
 *  0b01..fro1_max
 *  0b10..fro0_div3
 *  0b11..1m_lposc
 */
#define CLKCTL0_VDD2COMBASECLKSEL_SEL(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_VDD2COMBASECLKSEL_SEL_SHIFT)) & CLKCTL0_VDD2COMBASECLKSEL_SEL_MASK)
/*! @} */

/*! @name MAINCLKSEL - VDD2_COMP Main Clock Source Select */
/*! @{ */

#define CLKCTL0_MAINCLKSEL_SEL_MASK              (0x3U)
#define CLKCTL0_MAINCLKSEL_SEL_SHIFT             (0U)
/*! SEL - VDD2_COMP Main Clock Select Source
 *  0b00..baseclk_cmpt
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..audio_pll_pfd1
 */
#define CLKCTL0_MAINCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_MAINCLKSEL_SEL_SHIFT)) & CLKCTL0_MAINCLKSEL_SEL_MASK)
/*! @} */

/*! @name DSPCPUCLKDIV - VDD2_DSP Clock Divider */
/*! @{ */

#define CLKCTL0_DSPCPUCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL0_DSPCPUCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_DSPCPUCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_DSPCPUCLKDIV_DIV_SHIFT)) & CLKCTL0_DSPCPUCLKDIV_DIV_MASK)

