solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
#define CLKCTL0_DSPCPUCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL0_DSPCPUCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_DSPCPUCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_DSPCPUCLKDIV_BUSY_SHIFT)) & CLKCTL0_DSPCPUCLKDIV_BUSY_MASK)

#define CLKCTL0_DSPCPUCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL0_DSPCPUCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_DSPCPUCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_DSPCPUCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_DSPCPUCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name DSPCPUCLKSEL - VDD2_DSP Clock Select Source */
/*! @{ */

#define CLKCTL0_DSPCPUCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL0_DSPCPUCLKSEL_SEL_SHIFT           (0U)
/*! SEL - VDD2_DSP Clock Select Source
 *  0b00..baseclk_dsp
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..main_pll_pfd1
 */
#define CLKCTL0_DSPCPUCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_DSPCPUCLKSEL_SEL_SHIFT)) & CLKCTL0_DSPCPUCLKSEL_SEL_MASK)

#define CLKCTL0_DSPCPUCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL0_DSPCPUCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates output of clock mux.
 *  0b1..Enables output of clock mux.
 */
#define CLKCTL0_DSPCPUCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_DSPCPUCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_DSPCPUCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name RAMCLKSEL - RAM Clock Select Source */
/*! @{ */

#define CLKCTL0_RAMCLKSEL_SEL_MASK               (0x3U)
#define CLKCTL0_RAMCLKSEL_SEL_SHIFT              (0U)
/*! SEL - RAM Clock Select Source
 *  0b00..baseclk_com2
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..fro1_max
 */
#define CLKCTL0_RAMCLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_RAMCLKSEL_SEL_SHIFT)) & CLKCTL0_RAMCLKSEL_SEL_MASK)
/*! @} */

/*! @name RAMCLKDIV - RAM Clock Divider */
/*! @{ */

#define CLKCTL0_RAMCLKDIV_DIV_MASK               (0xFFU)
#define CLKCTL0_RAMCLKDIV_DIV_SHIFT              (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_RAMCLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_RAMCLKDIV_DIV_SHIFT)) & CLKCTL0_RAMCLKDIV_DIV_MASK)

#define CLKCTL0_RAMCLKDIV_BUSY_MASK              (0x10000000U)
#define CLKCTL0_RAMCLKDIV_BUSY_SHIFT             (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_RAMCLKDIV_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_RAMCLKDIV_BUSY_SHIFT)) & CLKCTL0_RAMCLKDIV_BUSY_MASK)

#define CLKCTL0_RAMCLKDIV_REQFLAG_MASK           (0x80000000U)
#define CLKCTL0_RAMCLKDIV_REQFLAG_SHIFT          (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_RAMCLKDIV_REQFLAG(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_RAMCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_RAMCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name TPIUFCLKSEL - TPIU (TRACE_RT700) Functional Clock Select Source */
/*! @{ */

#define CLKCTL0_TPIUFCLKSEL_SEL_MASK             (0x3U)
#define CLKCTL0_TPIUFCLKSEL_SEL_SHIFT            (0U)
/*! SEL - TPIU (TRACE_RT700) Clock Select Source
 *  0b00..baseclk_cmpt
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..fro0_div6
 */
#define CLKCTL0_TPIUFCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUFCLKSEL_SEL_SHIFT)) & CLKCTL0_TPIUFCLKSEL_SEL_MASK)

#define CLKCTL0_TPIUFCLKSEL_SEL_EN_MASK          (0x4U)
#define CLKCTL0_TPIUFCLKSEL_SEL_EN_SHIFT         (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for TPIU clock.
 *  0b1..Enables mux output for TPIU clock.
 */
#define CLKCTL0_TPIUFCLKSEL_SEL_EN(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUFCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_TPIUFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name TPIUCLKDIV - TPIU (TRACE_RT700) Functional Clock Divider */
/*! @{ */

#define CLKCTL0_TPIUCLKDIV_DIV_MASK              (0xFFU)
#define CLKCTL0_TPIUCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_TPIUCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_DIV_SHIFT)) & CLKCTL0_TPIUCLKDIV_DIV_MASK)

#define CLKCTL0_TPIUCLKDIV_BUSY_MASK             (0x10000000U)
#define CLKCTL0_TPIUCLKDIV_BUSY_SHIFT            (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_TPIUCLKDIV_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_BUSY_SHIFT)) & CLKCTL0_TPIUCLKDIV_BUSY_MASK)

#define CLKCTL0_TPIUCLKDIV_RESET_MASK            (0x20000000U)
#define CLKCTL0_TPIUCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_TPIUCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_RESET_SHIFT)) & CLKCTL0_TPIUCLKDIV_RESET_MASK)

#define CLKCTL0_TPIUCLKDIV_HALT_MASK             (0x40000000U)
#define CLKCTL0_TPIUCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_TPIUCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_HALT_SHIFT)) & CLKCTL0_TPIUCLKDIV_HALT_MASK)

#define CLKCTL0_TPIUCLKDIV_REQFLAG_MASK          (0x80000000U)
#define CLKCTL0_TPIUCLKDIV_REQFLAG_SHIFT         (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_TPIUCLKDIV_REQFLAG(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TPIUCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_TPIUCLKDIV_REQFLAG_MASK)
/*! @} */

