solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
/*! @name TRNGFCLKSEL - TRNG Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_TRNGFCLKSEL_SEL_MASK             (0x3U)
#define CLKCTL0_TRNGFCLKSEL_SEL_SHIFT            (0U)
/*! SEL - TRNG Functional Clock Source Select
 *  0b00..baseclk_cmpt
 *  0b01..fro1_div2
 *  0b10..fro1_div8
 *  0b11..fro1_div3
 */
#define CLKCTL0_TRNGFCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TRNGFCLKSEL_SEL_SHIFT)) & CLKCTL0_TRNGFCLKSEL_SEL_MASK)

#define CLKCTL0_TRNGFCLKSEL_SEL_EN_MASK          (0x4U)
#define CLKCTL0_TRNGFCLKSEL_SEL_EN_SHIFT         (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for TRNG clock.
 *  0b1..Enables mux output for TRNG clock.
 */
#define CLKCTL0_TRNGFCLKSEL_SEL_EN(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TRNGFCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_TRNGFCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name TRNGFCLKDIV - TRNG FCLK Clock Divider */
/*! @{ */

#define CLKCTL0_TRNGFCLKDIV_DIV_MASK             (0xFFU)
#define CLKCTL0_TRNGFCLKDIV_DIV_SHIFT            (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_TRNGFCLKDIV_DIV(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TRNGFCLKDIV_DIV_SHIFT)) & CLKCTL0_TRNGFCLKDIV_DIV_MASK)

#define CLKCTL0_TRNGFCLKDIV_BUSY_MASK            (0x10000000U)
#define CLKCTL0_TRNGFCLKDIV_BUSY_SHIFT           (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_TRNGFCLKDIV_BUSY(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TRNGFCLKDIV_BUSY_SHIFT)) & CLKCTL0_TRNGFCLKDIV_BUSY_MASK)

#define CLKCTL0_TRNGFCLKDIV_RESET_MASK           (0x20000000U)
#define CLKCTL0_TRNGFCLKDIV_RESET_SHIFT          (29U)
/*! RESET - Divider Counter Reset
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_TRNGFCLKDIV_RESET(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TRNGFCLKDIV_RESET_SHIFT)) & CLKCTL0_TRNGFCLKDIV_RESET_MASK)

#define CLKCTL0_TRNGFCLKDIV_HALT_MASK            (0x40000000U)
#define CLKCTL0_TRNGFCLKDIV_HALT_SHIFT           (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_TRNGFCLKDIV_HALT(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TRNGFCLKDIV_HALT_SHIFT)) & CLKCTL0_TRNGFCLKDIV_HALT_MASK)

#define CLKCTL0_TRNGFCLKDIV_REQFLAG_MASK         (0x80000000U)
#define CLKCTL0_TRNGFCLKDIV_REQFLAG_SHIFT        (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_TRNGFCLKDIV_REQFLAG(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_TRNGFCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_TRNGFCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name I3C01FCLKSEL - I3C0 and I3C1 Functional Clock Source Select */
/*! @{ */

#define CLKCTL0_I3C01FCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL0_I3C01FCLKSEL_SEL_SHIFT           (0U)
/*! SEL - I3C0 and I3C1 Functional Clock Source Select
 *  0b00..baseclk_cmpt
 *  0b01..fro0_max
 *  0b10..fro1_div8
 *  0b11..osc_clk
 */
#define CLKCTL0_I3C01FCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01FCLKSEL_SEL_SHIFT)) & CLKCTL0_I3C01FCLKSEL_SEL_MASK)

#define CLKCTL0_I3C01FCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL0_I3C01FCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Enable Clock Mux Output
 *  0b0..Gates mux output for I3C0 and I3C1 clocks.
 *  0b1..Enables mux output for I3C0 and I3C1 clocks.
 */
#define CLKCTL0_I3C01FCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01FCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_I3C01FCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name I3C01PCLKSEL - I3C0 and I3C1 P-CLK Source Select */
/*! @{ */

#define CLKCTL0_I3C01PCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL0_I3C01PCLKSEL_SEL_SHIFT           (0U)
/*! SEL - I3C0 and I3C1 P-CLK Source Select
 *  0b00..baseclk_cmpt
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..fro1_max
 */
#define CLKCTL0_I3C01PCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01PCLKSEL_SEL_SHIFT)) & CLKCTL0_I3C01PCLKSEL_SEL_MASK)

#define CLKCTL0_I3C01PCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL0_I3C01PCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Clock Mux Output Enable
 *  0b0..Gates mux output for I3C0 and I3C1 P-CLK.
 *  0b1..Enables mux output for I3C0 and I3C1 P-CLK.
 */
#define CLKCTL0_I3C01PCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01PCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_I3C01PCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name I3C01PCLKDIV - I3C0 and I3C1 P-CLK Divider */
/*! @{ */

#define CLKCTL0_I3C01PCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL0_I3C01PCLKDIV_DIV_SHIFT           (0U)
/*! DIV - I3C0, I3C1 Clock Divider Value */
#define CLKCTL0_I3C01PCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01PCLKDIV_DIV_SHIFT)) & CLKCTL0_I3C01PCLKDIV_DIV_MASK)

#define CLKCTL0_I3C01PCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL0_I3C01PCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_I3C01PCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01PCLKDIV_BUSY_SHIFT)) & CLKCTL0_I3C01PCLKDIV_BUSY_MASK)

#define CLKCTL0_I3C01PCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL0_I3C01PCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_I3C01PCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01PCLKDIV_RESET_SHIFT)) & CLKCTL0_I3C01PCLKDIV_RESET_MASK)

#define CLKCTL0_I3C01PCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL0_I3C01PCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_I3C01PCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01PCLKDIV_HALT_SHIFT)) & CLKCTL0_I3C01PCLKDIV_HALT_MASK)

#define CLKCTL0_I3C01PCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL0_I3C01PCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The Divider change has been finished.
 *  0b1..The change is being made to the divider value.
 */
#define CLKCTL0_I3C01PCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01PCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_I3C01PCLKDIV_REQFLAG_MASK)
/*! @} */

