solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL0.h
/*! @name I3C01FCLKDIV - I3C0 and I3C1 Functional Clock Divider */
/*! @{ */

#define CLKCTL0_I3C01FCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL0_I3C01FCLKDIV_DIV_SHIFT           (0U)
/*! DIV - I3C0 and I3C1 Clock Divider Value */
#define CLKCTL0_I3C01FCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01FCLKDIV_DIV_SHIFT)) & CLKCTL0_I3C01FCLKDIV_DIV_MASK)

#define CLKCTL0_I3C01FCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL0_I3C01FCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_I3C01FCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01FCLKDIV_BUSY_SHIFT)) & CLKCTL0_I3C01FCLKDIV_BUSY_MASK)

#define CLKCTL0_I3C01FCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL0_I3C01FCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Reset Divider Counter
 *  0b0..No effect
 *  0b1..Resets the divider counter.
 */
#define CLKCTL0_I3C01FCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01FCLKDIV_RESET_SHIFT)) & CLKCTL0_I3C01FCLKDIV_RESET_MASK)

#define CLKCTL0_I3C01FCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL0_I3C01FCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_I3C01FCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01FCLKDIV_HALT_SHIFT)) & CLKCTL0_I3C01FCLKDIV_HALT_MASK)

#define CLKCTL0_I3C01FCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL0_I3C01FCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change has been finished.
 *  0b1..The change is being made to the divider counter.
 */
#define CLKCTL0_I3C01FCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_I3C01FCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_I3C01FCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name CLKOUTCLKSEL - CLKOUT_VDD2 Clock Select Source */
/*! @{ */

#define CLKCTL0_CLKOUTCLKSEL_SEL_MASK            (0x3U)
#define CLKCTL0_CLKOUTCLKSEL_SEL_SHIFT           (0U)
/*! SEL - Select Clock Source
 *  0b00..baseclk_com2
 *  0b01..main_pll_pfd0
 *  0b10..fro0_max
 *  0b11..fro1_max
 */
#define CLKCTL0_CLKOUTCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CLKOUTCLKSEL_SEL_SHIFT)) & CLKCTL0_CLKOUTCLKSEL_SEL_MASK)

#define CLKCTL0_CLKOUTCLKSEL_SEL_EN_MASK         (0x4U)
#define CLKCTL0_CLKOUTCLKSEL_SEL_EN_SHIFT        (2U)
/*! SEL_EN - Enable Clock Mux Output
 *  0b0..Gates mux output for CLKOUT_VDD2 clock.
 *  0b1..Enables mux output for CLKOUT_VDD2 clock.
 */
#define CLKCTL0_CLKOUTCLKSEL_SEL_EN(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CLKOUTCLKSEL_SEL_EN_SHIFT)) & CLKCTL0_CLKOUTCLKSEL_SEL_EN_MASK)
/*! @} */

/*! @name CLKOUTCLKDIV - CLKOUT_VDD2 Clock Divider */
/*! @{ */

#define CLKCTL0_CLKOUTCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL0_CLKOUTCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock Divider Value Select */
#define CLKCTL0_CLKOUTCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CLKOUTCLKDIV_DIV_SHIFT)) & CLKCTL0_CLKOUTCLKDIV_DIV_MASK)

#define CLKCTL0_CLKOUTCLKDIV_BUSY_MASK           (0x10000000U)
#define CLKCTL0_CLKOUTCLKDIV_BUSY_SHIFT          (28U)
/*! BUSY - Busy Flag
 *  0b0..The CLKOUT_VDD2 is outputted with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_CLKOUTCLKDIV_BUSY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CLKOUTCLKDIV_BUSY_SHIFT)) & CLKCTL0_CLKOUTCLKDIV_BUSY_MASK)

#define CLKCTL0_CLKOUTCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL0_CLKOUTCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Reset the Divider Counter
 *  0b0..No effect
 *  0b1..Reset the Divider Counter
 */
#define CLKCTL0_CLKOUTCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CLKOUTCLKDIV_RESET_SHIFT)) & CLKCTL0_CLKOUTCLKDIV_RESET_MASK)

#define CLKCTL0_CLKOUTCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL0_CLKOUTCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halt Divider Counter
 *  0b0..No effect
 *  0b1..Halts (stops) the divider counter.
 */
#define CLKCTL0_CLKOUTCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CLKOUTCLKDIV_HALT_SHIFT)) & CLKCTL0_CLKOUTCLKDIV_HALT_MASK)

#define CLKCTL0_CLKOUTCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL0_CLKOUTCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL0_CLKOUTCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_CLKOUTCLKDIV_REQFLAG_SHIFT)) & CLKCTL0_CLKOUTCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name AUDIOVDD2CLKSEL - VDD2_COMP Audio Clock Source Select */
/*! @{ */

#define CLKCTL0_AUDIOVDD2CLKSEL_SEL_MASK         (0x3U)
#define CLKCTL0_AUDIOVDD2CLKSEL_SEL_SHIFT        (0U)
/*! SEL - Clock Source Select
 *  0b00..mclk_in
 *  0b01..osc_clk
 *  0b10..fro2_div8
 *  0b11..audio_pll_pfd3
 */
#define CLKCTL0_AUDIOVDD2CLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL0_AUDIOVDD2CLKSEL_SEL_SHIFT)) & CLKCTL0_AUDIOVDD2CLKSEL_SEL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group CLKCTL0_Register_Masks */


/*!
 * @}
 */ /* end of group CLKCTL0_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* CLKCTL0_H_ */

